import json

SINGLE_WALL = 'Одностінний'
DOUBLE_WALL = 'Двостінний'
types = [SINGLE_WALL, DOUBLE_WALL]
thicknesses = [0.5, 0.8, 1]
steels = {
    SINGLE_WALL: ['Нержавіюча сталь', 'Оцинкована сталь'],
    DOUBLE_WALL: ['Нержавіюча сталь/Нержавіюча сталь', 'Нержавіюча сталь/Оцинкована сталь'],
}
diameters = {
    SINGLE_WALL: [
        100,
        110,
        120,
        125,
        130,
        140,
        150,
        160,
        170,
        180,
        190,
        200,
        210,
        220,
        230,
        240,
        250,
        260,
        280,
        300,
        310,
        320,
        360,
    ],
    DOUBLE_WALL: [
        '100/160',
        '110/180',
        '120/180',
        '125/200',
        '130/200',
        '140/200',
        '150/220',
        '160/220',
        '180/250',
        '200/260',
        '220/280',
        '230/300',
        '250/320',
        '300/360',
    ],
}

stovepipes_detail = {
    'Димарі': {
        'Труба': {
            'Шаблон': '{name} {length}мм {steel} {thickness}мм Ø{diameter}мм',
            'Тип': types,
            'Сталь': steels,
            'Товщина сталі (мм)': thicknesses,
            'Довжина (мм)': [250, 300, 500, 1000],
            'Діаметр (мм)': diameters,
        },
        'Коліно': {
            'Шаблон': '{name} {corner}° {steel} {thickness}мм Ø{diameter}мм',
            'Тип': types,
            'Сталь': steels,
            'Товщина сталі (мм)': thicknesses,
            'Діаметр (мм)': diameters,
            'Кут': [45, 90],
        },
        'Трійник': {
            'Шаблон': '{name} {corner}° {steel} {thickness}мм Ø{diameter}мм',
            'Тип': types,
            'Сталь': steels,
            'Товщина сталі (мм)': thicknesses,
            'Діаметр (мм)': diameters,
            'Кут': [45, 87],
        },
        'Ревізія': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': types,
            'Сталь': steels,
            'Товщина сталі (мм)': thicknesses,
            'Діаметр (мм)': diameters,
        },
        'Грибок': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': types,
            'Сталь': steels,
            'Товщина сталі (мм)': [thicknesses[0]],
            'Діаметр (мм)': diameters,
        },
        'Іскрогасник': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': SINGLE_WALL,
            'Сталь': steels[SINGLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
        'Флюгер': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': SINGLE_WALL,
            'Сталь': steels[SINGLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
        'Дека': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': SINGLE_WALL,
            'Сталь': steels[SINGLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
        'Перехідник': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': SINGLE_WALL,
            'Сталь': steels[SINGLE_WALL],
            'Товщина сталі (мм)': thicknesses,
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
        'Скоба': {
            'Шаблон': '{name} {steel} Ø{diameter}мм',
            'Сталь': steels[SINGLE_WALL][0],
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
        'Конус': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': DOUBLE_WALL,
            'Сталь': steels[DOUBLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[DOUBLE_WALL],
        },
        'Стакан': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': DOUBLE_WALL,
            'Сталь': steels[DOUBLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[DOUBLE_WALL],
        },
        'Конденсатозбірники': {
            'Шаблон': '{name} {steel} {thickness}мм Ø{diameter}мм',
            'Тип': SINGLE_WALL,
            'Сталь': steels[SINGLE_WALL],
            'Товщина сталі (мм)': thicknesses[0],
            'Діаметр (мм)': diameters[SINGLE_WALL],
        },
    }
}

type_ = 'Двоконтурний'
fuel_types = 'Дрова, Брикети, Тирса, Вугілля'
work_pressure = 0.15
weight = [95, 100, 105, 115]

boilers = {
    'Твердопаливні котли': {
        'K': {
            'Шаблон': 'Твердопаливний котел МАРС {name}-{power}',
            'Тип котла': type_,
            'Типи палива': fuel_types,
            'Тип завантаження': 'Верхне',
            'Тривалість робочого циклу': '4-8',
            'Робочій тиск в системі опалення': work_pressure,
            'Потужність (кВт)': [12, 15, 18, 25],
            'Площа опалювання (м кв)': [120, 150, 180, 250],
            "Об'єм камери завантаження (л)": [53, 70, 85, 160],
            'Вага нетто (кг)': [120, 140, 160, 230],
            'Габарити ВхШхД (мм)': ['950х340х760', '950х410х760', '950х480х760', '1150х480х830'],
            'Мінімальна висота димаря (м)': [6, 6, 6, 7],
            'Розмір патрубку відводу продуктів згоряння (мм)': [127, 127, 159, 159],
            'Розмір приєднувальних патрубків': ['G1-B', 'G1-B', 'G2-B', 'G2-B'],
        },
        'KТК': {
            'Шаблон': 'Твердопаливний котел МАРС {name}-{power}',
            'Тип котла': type_,
            'Типи палива': fuel_types,
            'Тип завантаження': 'Фронтальне',
            'Тривалість робочого циклу': 4,
            'Робочій тиск в системі опалення': work_pressure,
            'Потужність (кВт)': [10, 12, 14, 16],
            'Площа опалювання (м кв)': [100, 120, 140, 160],
            "Об'єм камери завантаження (л)": [26, 34, 40, 46],
            'Вага нетто (кг)': [95, 100, 105, 115],
            'Габарити ВхШхД (мм)': ['850x450x650', '925x450x650', '1000x450x650', '1075x450x650'],
            'Мінімальна висота димаря (м)': 6,
            'Розмір патрубку відводу продуктів згоряння (мм)': 127,
            'Розмір приєднувальних патрубків': 'G2',
        },
    }
}

potbelly_stove = {
    'Буржуйки': {
        'Буржуйка': {
            'Тип палива': ['Дрова', 'Пелети', 'Кора', 'Брикети', 'Тирса'],
            'Тип топки': 'Відкрита',
            'Потужність (кВт)': 7,
            'Площа обігріву (м.кв)': 70,
            'Камера подвійного згоряння': 'Так',
            'Підключення до димаря': 'Верхнє',
            'Розташування печі-камін': 'Окремо',
            'Габаритні розміри ВхШхГ (мм)': '708х332х570',
            'Розмір патрубку відводу продуктів згоряння (мм)': 108,
            'Вага нетто (кг)': 50,
        }
    }
}


def create_compact_catalog_data():
    data = {**boilers, **potbelly_stove, **stovepipes_detail}
    with open('compact_catalog_data.json', 'w') as f:
        json.dump(data, f, ensure_ascii=False)


if __name__ == '__main__':
    create_compact_catalog_data()
